grant_hanrahan/week05/wednesday/mountains-db/app/controllers/mountains_controller.rb

  def create
    mountain = Mountain.new

    mountain.name = params[:name]
    mountain.location = params[:location]
    mountain.size = params[:size]
    mountain.image = params[:image]

    mountain.save
---
INSERT INTO "mountains" ("name", "location", "size", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def edit
    @mountain = Mountain.find params[:id]
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    mountain = Mountain.find params[:id]

    mountain.update(
      name: params[:name],
      location: params[:location],
      size: params[:size],
      image: params[:image]
    )
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "mountains" SET "image" = ?, "updated_at" = ? WHERE "mountains"."id" = ?  [["image", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Mount_Everest_morning.jpg/220px-Mount_Everest_morning.jpg"], ["updated_at", "2018-01-16 08:52:24.067750"], ["id", 1]]

  def index
    @mountains = Mountain.all
---
SELECT "mountains".* FROM "mountains"

  def show
    @mountain = Mountain.find params[:id]
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    Mountain.destroy params[:id]
---
DELETE FROM "mountains" WHERE "mountains"."id" = ?  [["id", 7]]