grant_hanrahan/week05/thursday/my-runs/app/views/runs/_form.html.erb

  <%= f.label :runner_id, 'Runner' %>
  <%= f.select :runner_id, Runner.pluck(:name, :id), include_blank: true %>
---
SELECT "runners"."name", "runners"."id" FROM "runners"