sahana_vajrakumar/week05/indiaplaces-db/app/controllers/places_controller.rb

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @place = Place.find params[:id]

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit

    @place = Place.find params[:id]

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "places" SET "image" = ?, "rating" = ?, "updated_at" = ? WHERE "places"."id" = ?  [["image", ""], ["rating", 8.0], ["updated_at", "2018-01-16 11:50:06.968549"], ["id", 1]]
---
  def update

    place = Place.find params[:id]

    place.update(
      name: params[:name],
      location: params[:location],
      image: params[:image],
      description: params[:description],
      rating: params[:rating]

    )