grant_hanrahan/week05/thursday/my-runs/app/views/runners/show.html.erb

<ul>
  <% @runner.runs.each do |run| %>
---
SELECT "runs".* FROM "runs" WHERE "runs"."runner_id" = ?  [["runner_id", 12]]