james_macleod/week05/albums-db/app/controllers/albums_controller.rb

  def show
    @album = Album.find params[:id]
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    album = Album.new

    album.name = params[:name]
    album.image = params[:image]
    album.year = params[:year]
    album.tracks = params[:tracks]
    album.link = params[:link]

    album.save
---
INSERT INTO "albums" ("name", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Blonde"], ["image", "https://hyperallergic.com/wp-content/uploads/2016/12/blond-1000.jpg"], ["created_at", "2018-01-16 08:38:47.611742"], ["updated_at", "2018-01-16 08:38:47.611742"]]

  def delete
    Album.destroy params[:id]
---
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 4]]

  def edit
     @album = Album.find params[:id]
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def update
    album = Album.find params[:id]

    album.update(
    name: params[:name],
    image: params[:image],
    year: params[:year],
    tracks: params[:tracks],
    link: params[:link]
  )
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "albums" SET "year" = ?, "tracks" = ?, "updated_at" = ? WHERE "albums"."id" = ?  [["year", 1997], ["tracks", 23], ["updated_at", "2018-01-16 23:40:31.147134"], ["id", 9]]