james_macleod/week05/albums-db-assc/app/views/albums/_form.html.erb

   <%= a.label :artist_id, 'Artist' %>
   <%= a.select :artist_id, Artist.all.pluck(:name, :id), include_blank: true  %>
---
SELECT "artists"."name", "artists"."id" FROM "artists"