james_macleod/week05/albums-db-assc/app/views/albums/show.html.erb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <h3>
        <% if @album.artist.present? %>