grant_hanrahan/week05/thursday/my-runs/app/controllers/runners_controller.rb

SELECT "runners".* FROM "runners"
---
  def index
    @runners = Runner.all

SELECT  "runners".* FROM "runners" WHERE "runners"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def show
    @runner = Runner.find params[:id]

SELECT  "runners".* FROM "runners" WHERE "runners"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
  def edit
    @runner = Runner.find params[:id]

SELECT  "runners".* FROM "runners" WHERE "runners"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "runners" SET "age" = ?, "updated_at" = ? WHERE "runners"."id" = ?  [["age", 38], ["updated_at", "2018-01-17 22:28:27.250633"], ["id", 16]]
---
  def update
    runner = Runner.find params[:id]
    runner.update runner_params

DELETE FROM "runners" WHERE "runners"."id" = ?  [["id", 16]]
---
  def destroy
    Runner.destroy params[:id]