grant_hanrahan/week05/thursday/my-runs/app/controllers/runs_controller.rb

SELECT "runs".* FROM "runs"
---
  def index
    @runs = Run.all

SELECT  "runs".* FROM "runs" WHERE "runs"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    @run = Run.find params[:id]

SELECT  "runs".* FROM "runs" WHERE "runs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @run = Run.find params[:id]