james_macleod/week05/albums-db-assc/app/controllers/artists_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
      @artist = Artist.find params[:id]

INSERT INTO "artists" ("name", "nationality", "genre", "twitter", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
      Artist.create artist_params

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def edit
      @artist = Artist.find params[:id]

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def update
      artist = Artist.find params[:id]